#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

module.KEYCLOAK_TEST.module.moh_applications.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PIDP-SERVICE/ADMIN"]: Refreshing state... [id=moh_applications/client/1065e2c3-8280-4bce-a170-e7fe044b285e/scope-mappings/55c07ad0-ac04-4eed-b98a-85aa8551163f/c043fe54-6899-4e2e-94b6-a85c0051b7ab]
module.KEYCLOAK_TEST.module.moh_applications.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PIDP-SERVICE/USER"]: Refreshing state... [id=moh_applications/client/1065e2c3-8280-4bce-a170-e7fe044b285e/scope-mappings/55c07ad0-ac04-4eed-b98a-85aa8551163f/1814fe67-a84e-4ca7-9bcc-656b02c64c98]
module.KEYCLOAK_TEST.module.moh_applications.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PIDP-SERVICE/feature_pidp_demo"]: Refreshing state... [id=moh_applications/client/1065e2c3-8280-4bce-a170-e7fe044b285e/scope-mappings/55c07ad0-ac04-4eed-b98a-85aa8551163f/458dd0fd-a742-4df1-b3ef-56ac85d7d8a9]
module.KEYCLOAK_TEST.module.moh_applications.module.DMFT-SERVICE.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PIDP-SERVICE/view_endorsement_data"]: Refreshing state... [id=c7d414f8-75ae-4cf2-a8dd-18f1c9b6d66b/445a4140-5403-464b-942e-d701738db30c]
module.KEYCLOAK_TEST.module.moh_applications.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["account/view-profile"]: Refreshing state... [id=moh_applications/client/1065e2c3-8280-4bce-a170-e7fe044b285e/scope-mappings/f7e7a2f0-6e8c-4037-ae60-439017c25321/cada8e04-363d-4213-a77f-2991c3fa50a3]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.KEYCLOAK_TEST.module.moh_applications.module.TPL.keycloak_openid_client.CLIENT will be created
  + resource "keycloak_openid_client" "CLIENT" {
      + access_token_lifespan                     = "300"
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "TPL"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + description                               = "Third Party Liability Keycloak for SSO"
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = false
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "TPL KeyCloak"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = "moh_applications"
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = false
      + standard_flow_enabled                     = true
      + use_refresh_tokens                        = false
      + use_refresh_tokens_client_credentials     = false
      + valid_redirect_uris                       = [
          + "https://bcmohtpl--tplqaa.sandbox.my.salesforce.com/*",
        ]
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.TPL.keycloak_openid_client_default_scopes.client_default_scopes will be created
  + resource "keycloak_openid_client_default_scopes" "client_default_scopes" {
      + client_id      = (known after apply)
      + default_scopes = [
          + "email",
        ]
      + id             = (known after apply)
      + realm_id       = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.TPL.keycloak_openid_user_client_role_protocol_mapper.client_role_mapper will be created
  + resource "keycloak_openid_user_client_role_protocol_mapper" "client_role_mapper" {
      + add_to_access_token         = true
      + add_to_id_token             = true
      + add_to_userinfo             = true
      + claim_name                  = "roles"
      + claim_value_type            = "String"
      + client_id                   = (known after apply)
      + client_id_for_role_mappings = "TPL"
      + id                          = (known after apply)
      + multivalued                 = true
      + name                        = "client roles"
      + realm_id                    = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.TPL.module.client-roles.keycloak_role.ROLES["TPL-Case-Analyst"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "TPL-Case-Analyst"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.TPL.module.client-roles.keycloak_role.ROLES["TPL-Finance-Analyst"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "TPL-Finance-Analyst"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.TPL.module.client-roles.keycloak_role.ROLES["TPL-System-Administrator"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "TPL-System-Administrator"
      + realm_id  = "moh_applications"
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @alex-tremblay-cgi, Action: `pull_request`*